#include "global.h"
#include "gflib.h"
#include "all.h"
#include "strings.h"
#include "unk_200C5DC.h"
#include "gflib/text.h"
#include "gflib/gfxload.h"
#include "libpmagb/pic_uncomp.h"
#include "libpmagb/agb_rom.h"
#include "libpmagb/berry.h"
#include "pokemon.h"
#include "constants/pokemon.h"
#include "constants/species.h"
#include "constants/moves.h"
#include "constants/items.h"
#include "constants/songs.h"

extern u8 gIsNotShowingMoveDetails; // Occupies the same memory as gMonSummaryScreen.isNotShowingMoveDetails
extern u8 gCurrentMoveSlot; // Occupies the same memory as gMonSummaryScreen.currentMoveSlot
extern u16 gSummaryCurrentMonMoves[]; // Occupies the same memory as gMonSummaryScreen.moves

extern const u32 gSummaryScreen_Pal[];
extern const u32 gSummaryScreen_Gfx[];
extern const u32 gSummaryIcons_Gfx[];
extern const u32 gSummaryScreen_Moves_Tilemap[];
extern const u32 gSummaryScreen_Skills_Tilemap[];
extern const u32 gTypeStatusIcons_Pal[];
extern const u32 gTypeStatusIcons_Gfx[];

struct PokemonSummaryScreenData
{
    /*0x00*/ struct Sprite *monSprite;
    /*0x04*/ struct Sprite *type1Sprite;
    /*0x08*/ struct Sprite *type2Sprite;
    /*0x0C*/ struct Sprite *ballSprite;
    /*0x10*/ struct Sprite *statusSprite;
    /*0x14*/ u16 species;
    /*0x16*/ u16 speciesPic;
    /*0x18*/ bool8 statsPrinted;
    /*0x19*/ u8 unused1[3];
    /*0x1C*/ struct Window *titleWindow;
    /*0x20*/ struct Window *leftWindow;
    /*0x24*/ struct Window *mainWindow;
    /*0x28*/ struct Window *inputWindow;
    /*0x2C*/ struct Sprite *moveTypeSprites[MAX_MON_MOVES];
    /*0x3C*/ u32 unused2;
    /*0x40*/ struct Sprite *moveSelectorSprite;
    /*0x44*/ u16 moves[MAX_MON_MOVES + 1]; // gSummaryCurrentMonMoves
    /*0x4E*/ u8 currentMoveSlot; // gCurrentMoveSlot
    /*0x4F*/ u8 isNotShowingMoveDetails; // gIsNotShowingMoveDetails
    /*0x50*/ u8 currentMonId;
    /*0x51*/ u8 unused4;
};

extern struct PokemonSummaryScreenData gMonSummaryScreen;

extern const struct Window gWindowTemplateSummaryMainPane;
extern const struct Window gWindowTemplateSummaryLeftPane;
extern const struct Window gWindowTemplateSummaryInputPane;
extern const struct Window gWindowTemplateSummaryTitlePane;

extern const struct Subsprites *const gMonFrontPicSubspriteTable[];
extern const struct Subsprites gSubspriteType[];
extern const struct Subsprites gSubspriteStatus[];
extern const struct Subsprites gSubspritePokeBall[];
extern const struct Subsprites gSubspriteMoveSelector[];

static void PrintMainInfo(u32 monId, bool32 skipInitialDraws);
static void sub_0200461C(struct Sprite *sprite);

// This file's functions
static void InitGraphics(void)
{
    ClearVram();
    REG_DISPCNT = DISPCNT_BG_ALL_ON | DISPCNT_OBJ_ON | DISPCNT_OBJ_1D_MAP;
    REG_BG0CNT = BGCNT_PRIORITY(0) | BGCNT_CHARBASE(0) | BGCNT_SCREENBASE(27);
